#!/bin/bash
echo "脚本名称		: $0"					#输出脚本名称
echo "第1个命令行参数: $1"					#输出第1个命令行参数
echo "第2个命令行参数: $2"					#输出第2个命令行参数
echo "第3个命令行参数: $3"					#输出第3个命令行参数
echo "第4个命令行参数: $4"					#输出第4个命令行参数
echo "第5个命令行参数: $5"					#输出第5个命令行参数
echo "第6个命令行参数: $6"					#输出第6个命令行参数
echo "第7个命令行参数: $7"					#输出第7个命令行参数
echo "第8个命令行参数: $8"					#输出第8个命令行参数
echo "第9个命令行参数: $9"					#输出第9个命令行参数
echo "所有的命令行参数: $*"					#输出所有的命令行参数
echo "命令行参数的个数: $#"					#输出命令行参数的个数
echo "PID : $$"								#输出当前进程的标识符
echo "error : $?"							#输出命令的退出状态
